[
  {
    "name": "Accounting",
    "description": "The Accounting Bounded Context is responsible for the financial core of the application, implementing a double-entry general ledger system. It manages the Chart of Accounts, recording all financial transactions as journal entries with balanced debits and credits. This context handles complex financial operations such as accruals, loan loss provisioning, and end-of-period closures to ensure financial integrity. It provides the mapping infrastructure to link portfolio products like loans and savings to specific ledger accounts for automated bookkeeping. Additionally, it supports financial reporting and trial balance generation.",
    "aggregates": [
      {
        "name": "General Ledger Account",
        "description": "This aggregate represents the fundamental building blocks of the financial system, defining the Chart of Accounts. It categorizes accounts into types such as Assets, Liabilities, Income, Expenses, and Equity, and manages their hierarchical structure. The aggregate enforces rules regarding account usage, distinguishing between header accounts for grouping and detail accounts for transaction recording. It maintains the configuration for manual journal entry permissions and disabled statuses. Furthermore, it supports the tracking of account balances over time.",
        "repository": {
          "name": "GLAccountRepository",
          "description": "This repository manages the persistence and retrieval of General Ledger Account entities. It supports hierarchical queries to fetch account trees and filtering by account type or usage. It also provides mechanisms to look up accounts by their unique GL codes."
        },
        "entities": [
          {
            "name": "GLAccount",
            "description": "Represents a specific general ledger account within the accounting system. It stores the account name, GL code, type, usage, and parent relationship. It also tracks whether manual journal entries are allowed for this account."
          },
          {
            "name": "GLClosure",
            "description": "Represents a closure of the accounting books for a specific office up to a certain date. It prevents any new financial transactions or modifications from being posted prior to the closure date. This ensures the immutability of finalized financial periods."
          }
        ]
      },
      {
        "name": "Journal Entry",
        "description": "The Journal Entry aggregate captures discrete financial transactions within the system, ensuring that every debit has a corresponding credit. It serves as the immutable audit trail for all financial activity, linking transactions to specific offices, dates, and currencies. This aggregate validates that entries are balanced before persistence and supports the reversal of transactions. It also manages the association between manual entries and system-generated entries triggered by portfolio events. Additionally, it supports the definition of opening balances for offices.",
        "repository": {
          "name": "JournalEntryRepository",
          "description": "This repository handles the storage and retrieval of financial transaction records. It allows for querying journal entries based on date ranges, transaction IDs, and account identifiers. It is optimized for high-volume writes and reporting queries."
        },
        "entities": [
          {
            "name": "JournalEntry",
            "description": "Represents a single line item within a financial transaction, recording a debit or credit amount. It links the amount to a specific GL Account, office, and transaction date. It also stores reference information to the originating business event."
          }
        ]
      },
      {
        "name": "Product Mapping",
        "description": "This aggregate manages the configuration rules that link portfolio products to the general ledger. It defines which GL accounts should be debited or credited for specific financial activities such as disbursements, repayments, or interest posting. The aggregate supports different accounting methodologies, including cash-based and accrual-based accounting. It ensures that financial transactions generated by the portfolio modules are automatically and correctly reflected in the accounting system. It handles mappings for various product types including loans, savings, and shares.",
        "repository": {
          "name": "ProductToGLAccountMappingRepository",
          "description": "This repository persists the configuration linking financial products to GL accounts. It allows for the retrieval of mapping rules based on product ID and financial activity type. It ensures that the accounting engine can resolve the correct accounts during transaction processing."
        },
        "entities": [
          {
            "name": "ProductToGLAccountMapping",
            "description": "Defines a specific rule linking a product and a financial activity to a GL Account. It stores the product type, the specific payment or charge type, and the target account. This entity drives the automated accounting logic."
          },
          {
            "name": "FinancialActivityAccount",
            "description": "Maps system-wide financial activities, such as asset transfers, to specific GL accounts. It ensures that non-product specific financial movements are correctly recorded. It is used for system-level accounting configurations."
          }
        ]
      }
    ]
  },
  {
    "name": "Infrastructure",
    "description": "The Infrastructure Bounded Context provides the foundational technical services and cross-cutting concerns required by the application. It manages system configuration, security, multi-tenancy, and extensibility features like data tables and hooks. This context handles the scheduling and execution of background jobs and batch processes. It also provides the audit trail mechanism to track all state-changing commands within the system. Additionally, it manages reference data codes and values used throughout the platform.",
    "aggregates": [
      {
        "name": "Scheduled Job",
        "description": "This aggregate manages the definition, scheduling, and execution of background tasks and batch jobs. It allows administrators to configure job frequencies using cron expressions and manage job parameters. The aggregate tracks the execution history of jobs, including start times, end times, and status outcomes. It supports the handling of custom job parameters passed as JSON. It ensures that critical system processes run reliably and provides visibility into their performance.",
        "repository": {
          "name": "ScheduledJobDetailRepository",
          "description": "This repository manages the persistence of job configurations and their runtime states. It allows for retrieving job details by ID or name and updating their schedules. It is used to coordinate job execution across the system."
        },
        "entities": [
          {
            "name": "ScheduledJobDetail",
            "description": "Represents the configuration of a background job, including its name and cron schedule. It tracks the current status of the job and the next scheduled run time. It serves as the blueprint for job execution."
          },
          {
            "name": "ScheduledJobRunHistory",
            "description": "Records the outcome of a specific execution instance of a scheduled job. It stores the start time, end time, status, and any error messages. This entity provides an audit log for background processing."
          }
        ]
      },
      {
        "name": "Command Source",
        "description": "The Command Source aggregate serves as the central audit log for all state-changing operations within the system. It captures the details of every API command, including the request payload, the user who initiated it, and the result. This aggregate supports the 'Maker-Checker' workflow by tracking commands that require approval before execution. It ensures accountability and traceability for all business actions. It also handles idempotency to prevent duplicate processing of the same command.",
        "repository": {
          "name": "CommandSourceRepository",
          "description": "This repository stores the history of all commands executed in the system. It supports querying for audit logs based on entity, action, and user. It is essential for the maker-checker functionality and system auditing."
        },
        "entities": [
          {
            "name": "CommandSource",
            "description": "Represents a single command or action performed within the system. It stores the JSON payload, the action name, the entity affected, and the processing status. It links the action to the user and the resulting resource ID."
          }
        ]
      },
      {
        "name": "Data Table",
        "description": "This aggregate provides the extensibility mechanism to attach custom data fields to core system entities. It manages the registration of dynamic tables and the validation rules for their usage. The aggregate allows the system to store and retrieve additional data without altering the core database schema. It supports the configuration of checks that enforce data entry in these tables during specific workflow steps. It enables the application to adapt to specific client data requirements.",
        "repository": {
          "name": "RegisteredDatatableRepository",
          "description": "This repository manages the metadata for registered data tables. It allows the system to look up custom tables associated with specific application entities. It supports the dynamic schema management of these extensions."
        },
        "entities": [
          {
            "name": "RegisteredDatatable",
            "description": "Stores the metadata definition of a custom data table, including its name and linked core entity. It defines the relationship between the extension table and the application table. It is used to dynamically resolve data storage locations."
          },
          {
            "name": "EntityDatatableChecks",
            "description": "Defines validation rules that require a data table to be populated for a specific entity status. It enforces business rules by preventing workflow transitions if required data is missing. It links a data table to a product and status."
          }
        ]
      }
    ]
  },
  {
    "name": "Loan Portfolio",
    "description": "This bounded context manages the entire lifecycle of lending products and individual loan accounts within the financial institution. It handles the definition of loan products, the processing of loan applications, and the management of active loans including disbursements, repayments, and interest calculations. The context enforces complex business rules regarding amortization schedules, interest recalculation, and delinquency tracking. It serves as the core financial engine for the lending side of the portfolio, ensuring accurate ledger updates and state transitions. Additionally, it manages the configuration of loan terms, variable installments, and associated charges.",
    "aggregates": [
      {
        "name": "Loan Account",
        "description": "The Loan Account aggregate is the central transactional entity representing a borrower's liability. It manages the state of the loan from submission to closure, handling complex financial logic such as interest accrual, repayment allocation, and schedule generation. It enforces rules regarding valid state transitions, such as preventing disbursement before approval. The aggregate maintains consistency between the loan summary, the repayment schedule, and the history of transactions. It also integrates with collateral and charge entities to provide a complete financial picture.",
        "repository": {
          "name": "LoanRepository",
          "description": "This repository provides persistence and retrieval mechanisms for Loan entities. It supports complex queries to filter loans by status, client, or office hierarchy. It ensures that loan data is loaded with necessary associations for processing while managing lazy loading to optimize performance."
        },
        "entities": [
          {
            "name": "Loan",
            "description": "The root entity representing the loan agreement, holding current balances, status, and configuration. It orchestrates the behavior of child entities and enforces the loan's lifecycle state machine. It serves as the primary point of interaction for loan-related business logic."
          },
          {
            "name": "LoanTransaction",
            "description": "Represents a financial event on the loan, such as a repayment, disbursement, or waiver. It records the amount, date, and type of transaction, linking it to the specific repayment schedule installment it affects. It provides an immutable audit trail of financial movements."
          },
          {
            "name": "LoanRepaymentScheduleInstallment",
            "description": "Defines a specific period within the loan term, detailing the principal, interest, fees, and penalties due. It tracks the paid and outstanding amounts for that specific period. This entity is crucial for determining the delinquency status of the loan."
          },
          {
            "name": "LoanCharge",
            "description": "Represents a fee or penalty applied to the loan account. It tracks the calculation method, amount due, and amount paid for specific charges. It links the financial charge definition to the specific loan instance."
          },
          {
            "name": "LoanAccountLock",
            "description": "Manages concurrency locks for loan accounts during batch processing. It prevents simultaneous updates to the same loan by different processes. It ensures data integrity during Close of Business operations."
          }
        ]
      },
      {
        "name": "Loan Product",
        "description": "The Loan Product aggregate defines the templates and configuration rules for creating new loans. It encapsulates settings for interest rates, accounting rules, repayment frequencies, and credit checks. This aggregate ensures that all loans created under a specific product adhere to the institution's policy constraints. It manages the lifecycle of the product definition itself, including valid dates and availability. It serves as a factory configuration for the Loan Account aggregate.",
        "repository": {
          "name": "LoanProductRepository",
          "description": "This repository handles the storage and retrieval of LoanProduct definitions. It allows for the management of product configurations and ensures that active products can be efficiently queried for loan creation. It supports filtering products based on currency and other attributes."
        },
        "entities": [
          {
            "name": "LoanProduct",
            "description": "The root entity defining the configuration parameters for a specific type of loan offering. It holds rules for interest calculation, amortization, and accounting mappings. It acts as a blueprint for instantiating individual Loan entities."
          },
          {
            "name": "LoanProductInterestRecalculationDetails",
            "description": "Stores configuration details regarding how interest should be recalculated for loans under this product. It defines compounding frequencies and rescheduling strategies. This entity ensures that complex interest rules are persisted alongside the product."
          },
          {
            "name": "LoanProductGuaranteeDetails",
            "description": "Defines the requirements for guarantors associated with loans of this product type. It specifies mandatory guarantee percentages and funding sources. It enforces risk management policies at the product level."
          }
        ]
      },
      {
        "name": "Delinquency Management",
        "description": "This aggregate manages the classification and tracking of overdue loans. It defines buckets and ranges to categorize loans based on the duration of their arrears. The aggregate provides the logic to apply delinquency tags to loans, which can trigger specific workflows or reporting. It ensures that the institution can accurately assess portfolio risk. It maintains a history of delinquency state changes for audit and analysis.",
        "repository": {
          "name": "DelinquencyBucketRepository",
          "description": "This repository manages the persistence of delinquency classification rules. It allows for the retrieval of bucket definitions used to categorize overdue loans. It ensures that delinquency configurations are available for the loan aging processes."
        },
        "entities": [
          {
            "name": "DelinquencyBucket",
            "description": "A container entity that groups multiple delinquency ranges together. It represents a specific policy or schema for classifying overdue loans. It allows different products to use different delinquency definitions."
          },
          {
            "name": "DelinquencyRange",
            "description": "Defines a specific time interval (e.g., 30-60 days) for classifying a loan's overdue status. It is associated with a bucket and provides a classification label. It is used to determine the specific tag applied to a loan."
          },
          {
            "name": "LoanDelinquencyTagHistory",
            "description": "Tracks the history of delinquency tags applied to a specific loan over time. It records when a loan entered or exited a specific delinquency range. This entity provides a temporal view of the loan's risk profile."
          }
        ]
      }
    ]
  },
  {
    "name": "Savings & Deposits",
    "description": "This bounded context handles the management of deposit accounts, including standard savings, fixed deposits, and recurring deposits. It manages the entire lifecycle of these accounts from application to maturity or closure. The context enforces rules regarding interest posting, compounding, and withdrawal limits. It integrates with the transaction processing system to handle deposits, withdrawals, and transfers. Additionally, it manages the configuration of savings products and their associated interest rate charts.",
    "aggregates": [
      {
        "name": "Savings Account",
        "description": "The Savings Account aggregate represents the customer's deposit account and manages its financial state. It handles transactions, enforces minimum balance rules, and calculates interest based on configured schedules. It supports specialized behaviors for fixed and recurring deposits, such as lock-in periods and maturity calculations. The aggregate ensures consistency between the account balance and the transaction history. It also manages the association with clients and groups.",
        "repository": {
          "name": "SavingsAccountRepository",
          "description": "This repository provides data access for SavingsAccount entities and their specialized subclasses. It supports retrieving accounts by client, status, or external identifier. It handles the persistence of account state changes and transaction links."
        },
        "entities": [
          {
            "name": "SavingsAccount",
            "description": "The core entity representing a deposit account, tracking balance, status, and interest settings. It serves as the base class for specialized deposit types. It manages the list of transactions and charges associated with the account."
          },
          {
            "name": "FixedDepositAccount",
            "description": "A specialized extension of SavingsAccount representing a fixed-term deposit. It includes logic for maturity dates, pre-closure penalties, and deposit term constraints. It enforces rules specific to time-bound investments."
          },
          {
            "name": "RecurringDepositAccount",
            "description": "A specialized extension of SavingsAccount for recurring deposit schemes. It manages the schedule of mandatory installment payments. It tracks the progress of the recurring deposit against the agreed schedule."
          },
          {
            "name": "SavingsAccountTransaction",
            "description": "Represents a financial movement within the savings account, such as a deposit or withdrawal. It records the amount, date, and resulting balance. It serves as the immutable ledger entry for the account."
          }
        ]
      },
      {
        "name": "Interest Rate Chart",
        "description": "This aggregate defines the rules for calculating interest rates based on deposit amounts and terms. It manages a collection of rate slabs that determine the applicable interest rate for a given scenario. The aggregate ensures that rate definitions do not overlap and cover the necessary ranges. It supports the application of incentives based on client attributes. It is a critical component for the profitability and attractiveness of deposit products.",
        "repository": {
          "name": "InterestRateChartRepository",
          "description": "This repository manages the persistence of interest rate charts and their associated slabs. It allows for the retrieval of active rate configurations for products and accounts. It ensures that historical rate data is preserved."
        },
        "entities": [
          {
            "name": "InterestRateChart",
            "description": "The root entity defining a scheme of interest rates valid for a specific period. It groups multiple slabs and defines the primary grouping field (amount or term). It is linked to savings products or individual accounts."
          },
          {
            "name": "InterestRateChartSlab",
            "description": "Defines a specific interest rate applicable for a defined range of amounts or terms. It holds the actual percentage value and the boundary conditions. It is a child entity of the InterestRateChart."
          },
          {
            "name": "InterestIncentives",
            "description": "Represents conditional interest rate adjustments based on client attributes like gender or age. It allows for targeted marketing or social performance incentives. It modifies the base rate defined in the slab."
          }
        ]
      }
    ]
  },
  {
    "name": "Client & Group Management",
    "description": "This bounded context is responsible for managing the customer base of the financial institution. It handles the creation and lifecycle of individual clients, groups, and centers. It manages Know Your Customer (KYC) data through client identifiers and documents. The context also handles the hierarchical relationships between clients, groups, and centers. It serves as the source of truth for customer identity and demographic information.",
    "aggregates": [
      {
        "name": "Client",
        "description": "The Client aggregate represents the individual customer and serves as the root for all customer-related data. It manages personal details, activation status, and associations with offices and staff. It enforces business rules regarding client onboarding and state transitions. The aggregate also manages the collection of identification documents and family member details. It is the primary entity for linking financial accounts to individuals.",
        "repository": {
          "name": "ClientRepository",
          "description": "This repository handles the persistence and retrieval of Client entities. It supports searching clients by name, identifier, or location. It ensures that client data is securely stored and accessible for portfolio operations."
        },
        "entities": [
          {
            "name": "Client",
            "description": "The core entity representing a customer, holding demographic and status information. It manages the lifecycle state (pending, active, closed) of the customer. It serves as the anchor for all client-specific associations."
          },
          {
            "name": "ClientIdentifier",
            "description": "Represents a specific identification document (e.g., passport, national ID) linked to a client. It stores the document type and unique key. It is used for KYC compliance and identity verification."
          },
          {
            "name": "ClientNonPerson",
            "description": "Captures details for clients that are legal entities (e.g., businesses) rather than individuals. It stores incorporation details and other corporate attributes. It extends the client profile to support business banking."
          }
        ]
      },
      {
        "name": "Group",
        "description": "The Group aggregate manages collections of clients organized for lending or social purposes. It handles the hierarchy of groups and centers, including staff assignments and meeting schedules. It enforces rules regarding group composition and lifecycle states. The aggregate facilitates group lending methodologies by linking clients together. It also manages the transfer of clients between groups.",
        "repository": {
          "name": "GroupRepository",
          "description": "This repository provides data access for Group and Center entities. It supports hierarchical queries to retrieve groups within centers or offices. It manages the persistence of group structures and memberships."
        },
        "entities": [
          {
            "name": "Group",
            "description": "Represents a collection of clients or other groups (centers). It manages the membership list and the group's status. It serves as a context for group loans and meetings."
          },
          {
            "name": "GroupLevel",
            "description": "Defines the hierarchical level of a group entity (e.g., Center vs. Group). It configures the rules for recursion and client membership at that level. It ensures the structural integrity of the group hierarchy."
          },
          {
            "name": "GroupRole",
            "description": "Defines a specific role assigned to a client within a group (e.g., Leader, Treasurer). It links a client to a group with a specific responsibility. It allows for the delegation of duties within the group structure."
          }
        ]
      }
    ]
  },
  {
    "name": "Notifications",
    "description": "The Notifications Bounded Context is responsible for managing communication with clients and staff via various channels. It handles the creation, scheduling, and execution of SMS and Email campaigns. This context allows the institution to send marketing messages, transaction alerts, and account updates. It tracks the delivery status of messages and integrates with external gateways for transmission. It also manages the configuration for different notification providers.",
    "aggregates": [
      {
        "name": "SMS Campaign",
        "description": "This aggregate manages the lifecycle of SMS marketing and notification campaigns. It allows users to define message content, target audiences, and scheduling triggers. The aggregate handles the generation of individual SMS messages based on the campaign configuration. It tracks the status of the campaign and the delivery success of generated messages. It supports both direct and event-triggered SMS dispatch.",
        "repository": {
          "name": "SmsCampaignRepository",
          "description": "This repository persists SMS campaign configurations and their states. It allows for retrieving active campaigns and those due for execution. It supports the management of campaign triggers and schedules."
        },
        "entities": [
          {
            "name": "SmsCampaign",
            "description": "Defines the configuration for a bulk SMS initiative, including the message template and trigger rules. It tracks the campaign's active status and schedule. It links to the report used to select recipients."
          },
          {
            "name": "SmsMessage",
            "description": "Represents an individual SMS queued for delivery or already sent. It stores the recipient's number, the message body, and the delivery status. It provides a record of communication history."
          }
        ]
      },
      {
        "name": "Email Campaign",
        "description": "The Email Campaign aggregate handles the definition and execution of email-based communications. It supports the configuration of email subjects, bodies, and attachment generation from reports. The aggregate manages the scheduling of emails and the tracking of their sent status. It integrates with SMTP configuration to dispatch messages. It allows for targeted communication based on business rules and reports.",
        "repository": {
          "name": "EmailCampaignRepository",
          "description": "This repository manages the storage of email campaign definitions. It supports querying for campaigns that need to be triggered based on time or events. It is used to persist the state of email marketing efforts."
        },
        "entities": [
          {
            "name": "EmailCampaign",
            "description": "Stores the settings for an email campaign, including subject, body, and attachment preferences. It defines the schedule or trigger for sending emails. It manages the lifecycle state of the campaign."
          },
          {
            "name": "EmailMessage",
            "description": "Represents a specific email generated for a recipient. It contains the final message content, recipient address, and status. It tracks whether the email was successfully sent or failed."
          },
          {
            "name": "EmailConfiguration",
            "description": "Stores the SMTP server settings and credentials required to send emails. It defines the host, port, and security protocols for the mail server. It is essential for the email service to function."
          }
        ]
      }
    ]
  },
  {
    "name": "Investor",
    "description": "The Investor Bounded Context manages the relationship between the financial institution and external asset owners. It handles the sale and buyback of loan assets, tracking ownership transfers and their financial implications. This context ensures that loans owned by external parties are correctly identified and that payments are allocated appropriately. It maintains a history of asset transfers and integrates with the accounting system to record sale and buyback transactions. It supports the management of investor portfolios.",
    "aggregates": [
      {
        "name": "External Asset Owner",
        "description": "This aggregate represents the external investors or entities that purchase loan assets. It manages the identity and details of these third-party owners. The aggregate serves as the parent entity for tracking which assets are currently owned by which investor. It ensures that unique external identifiers are maintained for integration purposes. It is central to the asset externalization workflow.",
        "repository": {
          "name": "ExternalAssetOwnerRepository",
          "description": "This repository manages the persistence of external asset owner entities. It allows for the retrieval of owner details by their internal or external identifiers. It supports the management of investor profiles."
        },
        "entities": [
          {
            "name": "ExternalAssetOwner",
            "description": "Represents an external investor entity in the system. It stores the owner's name and unique external identifier. It acts as the counterparty in asset transfer transactions."
          }
        ]
      },
      {
        "name": "Asset Transfer",
        "description": "The Asset Transfer aggregate manages the lifecycle of transferring loan ownership to and from external investors. It records the details of sales, buybacks, and cancellations, including settlement dates and purchase prices. The aggregate links specific loans to transfer events and tracks the status of these transactions. It also maintains mappings to accounting journal entries to ensure financial traceability. It enforces business rules regarding when a loan can be transferred.",
        "repository": {
          "name": "ExternalAssetOwnerTransferRepository",
          "description": "This repository persists the records of asset transfer transactions. It supports querying for active transfers, transfer history, and transfers associated with specific loans. It is key to tracking asset ownership changes."
        },
        "entities": [
          {
            "name": "ExternalAssetOwnerTransfer",
            "description": "Records a specific transaction transferring ownership of assets. It includes the transfer status, settlement date, and purchase price. It links the investor to the transfer event."
          },
          {
            "name": "ExternalAssetOwnerTransferLoanMapping",
            "description": "Maps a specific loan account to an asset transfer record. It establishes the link between the portfolio loan and the investor transaction. It is used to identify which loans are currently externalized."
          }
        ]
      }
    ]
  },
  {
    "name": "Credit Bureau",
    "description": "The Credit Bureau Bounded Context facilitates the integration with external credit reporting agencies. It manages the configuration of credit bureau connections and the mapping of loan products to credit check requirements. This context handles the retrieval, storage, and viewing of credit reports for clients. It ensures that credit checks are performed according to configured rules during the loan origination process. It acts as a bridge between the core banking system and external credit data providers.",
    "aggregates": [
      {
        "name": "Credit Bureau Configuration",
        "description": "This aggregate manages the setup and configuration of external credit bureaus. It stores connection details, product mappings, and organization-specific settings. The aggregate defines which loan products require credit checks and how those checks should be performed. It allows the institution to configure multiple credit bureaus and link them to different products. It ensures that the system knows how to communicate with external credit services.",
        "repository": {
          "name": "CreditBureauConfigurationRepository",
          "description": "This repository manages the persistence of credit bureau configuration settings. It allows for retrieving configuration parameters by bureau ID or key. It supports the dynamic setup of credit bureau integrations."
        },
        "entities": [
          {
            "name": "CreditBureau",
            "description": "Represents a credit bureau agency definition. It stores the bureau's name, country, and implementation class key. It serves as the root definition for a credit provider."
          },
          {
            "name": "CreditBureauLoanProductMapping",
            "description": "Configures the relationship between a loan product and a credit bureau. It defines rules such as whether a credit check is mandatory. It links the product configuration to the bureau definition."
          }
        ]
      },
      {
        "name": "Credit Report",
        "description": "The Credit Report aggregate manages the credit data retrieved from external bureaus. It stores the raw report content, often as binary data, linked to a specific client and bureau. The aggregate allows for the persistence and retrieval of historical credit reports for review. It ensures that credit information is associated with the correct national ID or client identifier. It serves as the local cache of external credit information.",
        "repository": {
          "name": "CreditReportRepository",
          "description": "This repository handles the storage and retrieval of credit report data. It supports fetching reports based on client identifiers and bureau IDs. It allows the system to access previously fetched credit reports."
        },
        "entities": [
          {
            "name": "CreditReport",
            "description": "Stores the actual credit report data received from a bureau. It contains the binary report file and associated metadata like the national ID. It represents a snapshot of a client's credit history."
          }
        ]
      }
    ]
  },
  {
    "name": "Organization & Administration",
    "description": "This bounded context manages the operational structure and security of the institution. It defines the hierarchy of offices, the staff members, and the user authentication system. It also handles cash management through the teller module. The context provides the foundational configuration for currency, working days, and holidays. It ensures that the system reflects the physical and logical organization of the business.",
    "aggregates": [
      {
        "name": "Teller Management",
        "description": "The Teller Management aggregate controls the cash handling operations within branches. It manages the assignment of cashiers to tellers and tracks cash allocations and settlements. It enforces limits and validates transaction dates to ensure cash accountability. The aggregate serves as the bridge between physical cash movements and digital transaction records. It ensures that cashiers have sufficient funds for disbursements.",
        "repository": {
          "name": "TellerRepository",
          "description": "This repository manages the persistence of Teller definitions. It allows for the retrieval of tellers associated with specific offices. It supports the configuration of cash management points."
        },
        "entities": [
          {
            "name": "Teller",
            "description": "Represents a physical or logical point of service for cash transactions. It is associated with a specific office and tracks its operational status. It serves as the parent entity for cashier assignments."
          },
          {
            "name": "Cashier",
            "description": "Represents a staff member assigned to a teller for a specific period. It tracks the duration of the assignment and the type of operations allowed. It links the human resource to the cash management function."
          },
          {
            "name": "CashierTransaction",
            "description": "Records specific cash movements (allocation, settlement) involving a cashier. It tracks the amount and type of cash transfer. It provides an audit trail for cash handling activities."
          }
        ]
      },
      {
        "name": "User Administration",
        "description": "The User Administration aggregate manages system access and security. It handles the creation of application users, role assignments, and permission configurations. It enforces password policies and authentication rules. The aggregate ensures that only authorized personnel can access specific data and functions. It serves as the gatekeeper for the application's security model.",
        "repository": {
          "name": "AppUserRepository",
          "description": "This repository handles the storage and retrieval of application user accounts. It supports looking up users by username or office. It is critical for the authentication and authorization processes."
        },
        "entities": [
          {
            "name": "AppUser",
            "description": "Represents a system user who can log in and perform actions. It links to staff records and holds authentication credentials. It is the central entity for identity management."
          },
          {
            "name": "Role",
            "description": "Defines a set of permissions that can be assigned to a user. It groups access rights into logical job functions. It simplifies the management of user privileges."
          },
          {
            "name": "Permission",
            "description": "Represents a granular access right to a specific resource or action. It defines what operations are allowed within the system. It is the fundamental building block of the authorization model."
          }
        ]
      }
    ]
  },
  {
    "name": "Shared Services",
    "description": "This bounded context provides cross-cutting functionality used by multiple other contexts. It includes the notification system for user alerts, the template engine for document generation, and the tax management module. It ensures that common infrastructure needs are met in a standardized way. This context decouples auxiliary services from the core business domains.",
    "aggregates": [
      {
        "name": "Notification",
        "description": "The Notification aggregate manages the generation and tracking of system alerts. It captures events from other domains and creates notification records for users. It tracks the read status of notifications to ensure users are aware of important activities. The aggregate serves as the internal messaging backbone for user awareness. It supports different types of notifications based on business events.",
        "repository": {
          "name": "NotificationRepository",
          "description": "This repository manages the persistence of notification events. It allows for the retrieval of notifications for specific users. It supports the tracking of unread notifications."
        },
        "entities": [
          {
            "name": "Notification",
            "description": "Represents a specific alert or message generated by the system. It contains the content, actor, and target of the event. It serves as the persistent record of the notification."
          },
          {
            "name": "NotificationMapper",
            "description": "Maps a notification to a specific user recipient. It tracks whether the user has read the notification. It allows a single notification event to be distributed to multiple users."
          }
        ]
      },
      {
        "name": "Tax Management",
        "description": "The Tax Management aggregate defines the configuration for tax calculations. It groups tax components into tax groups to allow for complex tax structures. It manages the validity periods and rates for different taxes. The aggregate ensures that tax rules are applied consistently across different financial products. It serves as the central definition for tax logic.",
        "repository": {
          "name": "TaxGroupRepository",
          "description": "This repository handles the persistence of Tax Group definitions. It allows for the retrieval of tax configurations used by products. It ensures that tax mappings are stored correctly."
        },
        "entities": [
          {
            "name": "TaxGroup",
            "description": "Represents a collection of tax components applied together. It allows for the aggregation of multiple taxes into a single rule. It manages the lifecycle of tax associations."
          },
          {
            "name": "TaxComponent",
            "description": "Defines a specific tax type and its rate. It includes validity dates to handle rate changes over time. It is the fundamental unit of tax calculation."
          }
        ]
      }
    ]
  }
]